com.apple.private.ANEStorageMaintainer

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-// Apple //DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/Property List-1.0.dtd">
<plist version="1.0">
	<dict>
	<key>com.apple.rootless.storage.ane_model_cache</key>
	<true>
	<key>com.apple.rootless.storage.triald</key>
	<true/>
	<key>platform-application</key>
	<true/>
</dict>
</plist>


/usr/lib/dyld
/System/Library/PrivateFrameworks/ANECompiler.framework/Versions/A/ANECompiler
/usr/lib/libMobileGestalt.dylib
/System/Library/Frameworks/Foundation.framework/Versions/C/Foundation
/usr/lib/libobjc.A.dylib
/usr/lib/libc++.1.dylib
/usr/lib/libSystem.B.dylib
/System/Library/Frameworks/CoreFoundation.framework/Versions/A/CoreFoundation
/System/Library/Frameworks/IOKit.framework/Versions/A/IOKit
/System/Library/Frameworks/IOSurface.framework/Versions/A/IOSurface
/System/Library/PrivateFrameworks/CoreAnalytics.framework/Versions/A/CoreAnalytics
/usr/lib/libcompression.dylib

com.apple.ane.programIOSurfacesMapperkANEFModelTypekANEFModelCoreMLkANEFModeLANECIRkANEFModelPreCompiledkANEFModelMILkANEFNetPlistFilenameKeykANEFCompilerOptionsFilenameKeykANEFModelLoadPerformanceStatskANEFEnablePowerSavingKeykANEFEnableLateLatchKeykANEFEspressoFileResourcesKeykANEFIntermediateBufferHandleKeykANEFModelIsEncryptedKeykANEFMemoryPoolIDKeykANEFModelIdentityStrKeyANEFModelDescriptionANEFModelProceduresANEFModelProcedureIDANEFModelInputSymbolIndexArrayANEFModelOutputSymbolIndexArraykANEFModelInputSymbolsArrayKeykANEFModelOutputSymbolsArrayKeykANEFModelProcedureNameToIDMapKeykANEFModelProcedureNameToStatsSizeMapKeykANEFPerformanceStatsMaskkANEFDisableIOFencesUseSharedEventsKeykANEFISInMemoryModelTypeKeykANEFInMemoryModelIsCachedKeycom.apple.appleneuralengine._ANEModel.AllSegmentskANEModelKeyEspressoTranslationOptionskANE_AF_TO_L2_DATAkANE_AF_TO_KM_DATAkANE_L2_TO_AF_DATAkANE_L2_TO_NE_DATAkANE_NE_TO_L2_DATAkANE_INT8_CYCLESkANE_NOMINAL_CYCLESkANE_L2PE_COMPUTE_CYCLESkANE_L2PE_INPUT_STALL_CYCLESkANE_L2PE_OUTPUT_STALL_CYCLESkANE_UKNOWN%@:{hwExecutionTime=%lluperfCounterData=%@}%@:FP16_CYCLES:kANE_L2_READ_STALL_CYCLESkANE_L2_WRITE_STALL_CYCLESkANE_KM_STALL_CYCLESkANE_NE_NOMINAL_CYCLESkANE_NE_THROTTLECYCLESkANE_L2_THROTTLE_CYCLESkANE_NE_COMPUTECYCLESkANE_NE_INPUT_STALL_CYCLESkANE_NE_OUTPUT_STALL_CYCLESkANE_NE_KERNEL_STALL_CYCLESkANE_DMA_READWRITE_BYTESkANE_DMA_READ_BYTESkANE_DPE_ENERGYkANE_L2_requires restricted access connection and (%@) entitlement%@: Realtime priority requires restricted access connection and (%@) entitlement%@: timed out%@: Program creation failure%@: Program Inference overflow%@: Program Inference error%@: Program Load failure%@: Program Load failure (0x%X)%@: Program IOSurfaces map failure (0x%X)%@: Program IOSurfaces unmap failure (0x%X)%@: Missing code signing identity%@: file access failure%@: invalid model%@: invalid model key%@: system model purge not allowedcom.apple.ane.devicecontroller/System/Library/PrivateFrameworks/ANEServices.framework/ANEServicesH11ANEDeviceOpen %s: statusType=%d pRefCon=%p : device=%p
programInstance=%pfDeviceCallbackANEReset@"NSDictionary"8@?
Ocom.apple.mediaserverdMediaServerdUsing
ANEcom.apple.mediaanalysisdMediaAnalysisdUsingANEcom.apple.photoanalysisdPhotosAnalysisdUsingANEcom.apple.ANECelestial.intermediateBufferHandle = %llu:
voicedNeuralTextToSpeechUsingANEVision.frameworkVisionUsingANEARKit.frameworkARKitUsingANEAppleCVA.frameworkFaceKitUsingframeworkCameraUsingANEVideoProcessing.frameworkVideoProcessingUsingANECoreHandwriting.frameworkHandWritingRecognitionUsing ANETextRecognition. frameworkOCRUsingANESoundAnalysis.frameworkSoundAnalysisUsingANEPrivateFrameworks/Frameworks//%@.%@%@: { programHandle=%llu queueDepth=%d % @: ANEProgramProcessRequestDirect() Failed with status=0x%x: statusType=0x% x%@: 0x%xInferenceOverflowed%@: Expecting EventPayLoad 0x%xModelFailsToRunv72@?0{ANENotificationMessage Struct=ii^v[4^v][41]}
8kern.hv_vmm_presentcom.apple.ane.avcAppleVirtIONeuralEngineDevice%@%@ .model.espresso.netmodel.espresso.shapemodel.espresso.weightshwxnet%@net%@shape % @/%@%@/net.plistshapeweightsstorageFailed with NULL databaseAddressInternalBuild+N9mZUAHooNvMiQnjeTJ8geJGhnVvyLF3dMOHBKJzeiwh11m9h12h13h14h15gBuildVersion ProductNamekern.bootargs%senforceModelSignatureChecks=0%@: boot-args has %@ - allow any path for Pre-compiled modelscom.apple.aned.storageAsyncIOv24@?0^v8Q16kANEAccessSeconds B24@?0@"NSURL"8@"NSError" 16Success! 
iTOTALDETAILS com.apple.appleneuralengine com.apple.aned. CacheDeletecom.apple.appleneuralengine.private/Library/Caches/
com.apple.anedInMemoryModelCacheModelAssetsCachetmpclonescom.apple.SHARED_SYSTEM_MODELS/System/Library/Apple Internal/
Librarycom.apple.appleneuralengine.compilercom.apple.appleneuralengine.espressocom.apple.aned.private.allowcom.apple.aned.private.aggressivePowerSaving.allowcom.model_cachenet.plistcompiler_options_plistmodel.milcom.apple.aned. Launchcom.apple.ANEUsageThirdParty AppUsingANE/var/tmp/com.apple.aned/Cache/%@%@//var/tmp/
apple.ANECompilerService.allowcom.apple.private.modelPurge InAllPartitions.allowcom.apple.private.ANEStorageMaintainer.allowmodel.hwxmodel.srcnet_options.plistane_
com.apple.aned/UnitTesting/var/tmp/com.apple.aned/UnitTestingClones/Apple Internal/Tests/AppleNeuralEngine/AppleNeuralEngine_tests.xctestTestModelsContents/
ResourceszeroModelsmallModeloverflowModelencryptedModeltesting_ane_model_cache/System/Library/Frameworks/Vision.framework/bodynet_v1.0.espresso.net/System/Library/Templates/Data/AppleInternal/Library/Frameworks/FRC.framework/Versions/A/Resources/Networks/synthesis_net_GridNet_pyrlite.H13.espresso.hwxanedclientcompilermaintenanceanetoolcommontestscom.apple.anecomponentsSeparatedByString:objectForKeyedSubscript:valueForEntitlement:resumedataWithBytes:length:unsignedIntegerValuearrayWithObjects:count:initForReadingFromData:error:fileSizesubpathsOfDirectoryAtPath:error:isEqualToString:objectForKey:setExportedObject:perfStatsMaskvaluecompletionHandlerdataUsingEncoding:archivedDataWithRootObject:requiringSecureCoding:error:setWithArray:fileExistsAtPath:isDirectory:unsignedIntValuesetExportedInterface:UTF8Stringcompare:string_idperfStatsArraydictionaryWithObjectsAndKeys:objectAtIndexedSubscript:appendString:modelAttributesstringWithUTF8String:removeItemAtURL:error:ioSurfacesCountperfStatsnumberWithUnsignedLongLong:statsdictionaryWithObjects:forKeys:count:validatetransactionHandleURLByAppendingPathComponent:setTransactionHandle:setDelegate:eventTyperemoveItemAtPath:error:stringWithFormat:ioSurfacenumberWithUnsignedLong:statTypeURLByDeletingLastPathComponenttimeIntervalSince1970setProgram:pathComponentsstringWithContentsOfURL:encoding:error:invalidateerrorWithDomain:code:userInfo:copynumberWithUnsignedInteger:destinationOfSymbolicLinkAtPath:error:initWithFormat:startOffsetsetPerfStats:setByAddingObjectsFromArray:defaultManagerpathupdateModelAttributes:state:programHandle:intermediateBufferHandle:queueDepth:numberWithLongLong:bytesallKeyslengthsetObject:forKeyedSubscript:countByEnumeratingWithState:objects:count:enumeratorAtURL:includingPropertiesForKeys:options:errorHandler:interfaceWithProtocol:stringByReplacingOccurrencesOfString:withString:updateModelAttributes:state:decodeObjectOfClasses:forKey:mutableCopyprocessIdentifierlastPathComponentsetMapper:countstringByDeletingLastPathComponentsetcontainsString:dateWithTimeIntervalSinceNow:inputSymbolIndicesForProcedureIndex:outputSymbolIndicesForProcedureIndex:mutableBytesinitWithContentsOfFile:signalEventslastObjectstringByAppendingPathComponent:procedureIndexserviceListenercontainsIndex:inputIndexArraydateWithTimeIntervalSince1970:outputIndexArrayweightsBufferinitWithBytesNoCopy:Length:deallocator:firstObjectmodelURLboolValuesharedEventsaddObject:keyJSONObjectWithData:options:error:waitEventsinputArrayoutputArraydataWithLength:attributesOfItemAtPath:error:unsignedLongLongValueaddEntriesFromDictionary:initWithBytes:Length:sharedEventfileTypesymbolIndexinitdeallocinitializenewmapperWithProgramHandle:mapperWithController:initWithController:validateRequest:model:prepareANEMemoryMappingParams:request:mapIOSurfacesWithModel:request:cacheInference:error:unmapIOSurfacesWithModel:request:error:deviceControllercontrollerprogramHandle.cxx_destruct_deviceController_controller_programHandleT@"_ANEDeviceController",R,N,V_controllerTQ,R,N,V_programHandleT@"_ANEDeviceController",R,N,V_deviceControllerdriverMaskForANEFMask:statsWithRequestPerformanceBuffer:statsBufferSize:statsWithHardwareExecutionNS:statsWithReconstructed:hardwareExecutionNS:stringForPerfCounter:descriptioninitWithHardwareExecution:perfCounterData:initWithRequestPerformanceBuffer:statsBufferSize:initWithReconstructedData:hardwareExecutionNS:performanceCountersemitPerfcounterSignpostsWithModelStringID:hwExecutionTimeperfCounterData_hwExecutionTime_perfCounterDataT@"NSData",R,N,V_perfCounterDataTQ,R,N,V_hwExecutionTimecreateErrorWithCode:description:entitlementErrorForMethod:priorityErrorForMethod:timeoutErrorForMethod:programCreationErrorForMethod:programInferenceOverflowErrorForMethod:
programInferenceOtherErrorForMethod:programLoadErrorForMethod:programLoadErrorForMethod:code:programIOSurfacesMapErrorForMethod:code:programIOSurfacesUnmapErrorForMethod:code:missingCodeSigningErrorForMethod:fileAccessErrorForMethod:invalidModelErrorForMethod:invalidModelKeyErrorForMethod:systemModelPurgeNotAllowedForMethod:controllerWithProgramHandle:sharedPrivilegedConnectioninitWithProgramHandle:priviledged:startstopusecountsetUsecount:isPrivilegeddevicesetDevice:_isPrivileged_usecount_deviceTq,N,V_usecountTB,R,N,V_isPrivilegedT^{ANEDeviceStruct=^v^v^vCi},N,V_deviceaddValue:forScalarkey:reportClient:modelName:analyticsKey:programWithHandle:intermediateBufferHandle:queueDepth:programWithController:intermediateBufferHandle:queueDepth:initWithController:intermediateBufferHandle:queueDepth:programInferenceOtherErrorForMessage:model:methodName:processRequest:model:qos:qIndex:modelStringID:options:error:setProgramHandle:intermediateBufferHandlesetIntermediateBufferHandle:queueDepthrequestsInFlightcurrentAsyncRequestsInFlightsetCurrentAsyncRequestsInFlight:_queueDepth_intermediateBufferHandle_requestsInFlight_currentAsyncRequestsInFlightTQ,N,V_programHandleTQ,N,V_intermediateBufferHandleTc,R,N,V_queueDepthT@"NSObject<OS_dispatch_semaphore>",R,N,V_requestsInFlightTq,V_currentAsyncRequestsInFlightsharedConnectioninitWithSingletonAccesscompileModel:options:qos:error:LoadModel:options:qos:error:unloadModel:options:qos:error:evaluateWithModel:options:request:qos:error:doEvaluateWithModel:options:request:qos:error:compiledModelExistsFor:purgeCompiledModel:compiledModelExistsMatchingHash:purgeCompiledModelMatchingHash:beginRealTimeTaskendRealTimeTaskecho:hasANEaneSubtypesendGuestBuildVersionexchangeBuildVersionInfodoMapIOSurfacesWithModel:request:cacheInference:error:copyModel:options:vmData:readWeightFilename:doJsonParsingMatchWeightName:parallelDecompressedData:copyOptions:vmData:copyModelOptionFiles:options:vmData:copyErrorValue:copyToIOSurface:length:ioSID:getModelAttribute:callIOUserClient:inParams:outParams:checkKernReturnValue:selector:outParams:updateError:error:updatePerformanceStats:releaseIOSurfaces:connectqueuehostBuildVersionsetHostBuildVersion:hostDataInterfaceVersionsetHostDataInterfaceVersion:hostCapabilityMasksetHostCapabilityMask:_connect_hostDataInterfaceVersion_queue_hostBuildVersion_hostCapabilityMaskTI,R,N,V_connectT@"NSObject<OS_dispatch_queue>",R,N,V_queueT@"NSString",&,N,V_hostBuildVersionTI,N,V_hostDataInterfaceVersionTQ,N,V_hostCapabilityMaskisInternalBuildaneBoardTypeaneSubTypeisExcessivePowerDrainWhenIdleaneSubTypeVariantaneSubTypeProductVariantbuildVersionproductNamebootArgsprecompiledModelChecksDisabledpurgeDanglingModelsAt:withReply:isEqual:classselfperformSelector:performSelector:withObject:performSelector:withObject:withObject:isProxyisKindOfClass:isMemberOfClass:conformsToProtocol:respondsToSelector:retainreleaseautoreleaseretainCountzonehashsuperclassdebugDescriptionTQ,RT#,RT@"NSString",R,Clistener:shouldAcceptNewConnection:removeDirectoryAtPath:memoryMapModelAtPath:modelAttributes:memoryMapModelAtPath:isPrecompiled:modelAttributes:setAccessTime:forModelFilePath:getAccessTimeForFilePath:updateAccessTimeForFilePath:removeFilePath:ifDate:olderThanSecond:garbageCollectDanglingModelsAtPath:uniqueFirstLevelSubdirectories:sizeOfDirectoryAtPath:recursionLevel:addSubdirectoryDetails:directoryPath:size:createModelCacheDictionarysizeOfModelCacheAtPath:purgeSubdirectories:mergeModelCacheStorageInformation:with:_markPurgeablePath:error:markPathAndDirectParentPurgeable:error:enableApfsPurgingmachServiceNamecacheDeleteServiceNamemachServiceNamePrivatemodelDataVaultDirectorybuildSpecificModelDataVaultDirectoryinMemoryModelCacheNamemodelAssetsCacheNametempDirectorycloneDirectorysystemModelsCacheDirectorysystemLibraryPathinternalLibraryPatherrorDomainGenericerrorDomainCompilererrorDomainEspressorestrictedAccessEntitlementaggressivePowerSavingEntitlementcompilerServiceAccessEntitlementmodelPurgeInAllPartitionsEntitlementstorageMaintainerAccessEntitlementmodelBinaryNamemodelSourceStoreNamedefaultCompilerOptionsFilenamedataVaultStorageClassdefaultANECIRFileNamedefaultANECIROptionsFileNamedefaultMILFileNamenoSandboxExtensionlaunchIOKitEventcoreAnalyticsANEUsageKeyGroupcoreAnalyticsANEUsageDefaultReportedClienttesting_cacheDirectorytesting_cacheDirectoryWithSuffix:testing_cacheDirectoryWithSuffix:buildVersion:testing_tempDirectory:testing_cloneDirectory:testing_inputDirectorytesting_modelDirectorytesting_modelDirectory:testing_zeroModelNametesting_modelNamestesting_encryptedModelNamestesting_dataVaultStorageClasstesting_external_modelPathtesting_external_precompiledModelPathdaemonframeworkcompilermaintenancetoolcommontests%@:
[request ioSurfacesCount] = %lu is invalid. Expected: (1 %d)%@: request.inputIndexArray[%u]=%u is invalid%@: request.outputIndexArray[%u]=%u is invalid%@: No support for VirtualClient yet. ----->%@: ANEProgramMemoryMapRequest() ret=0x%x --- -->%@: ANEProgramMemoryUnMapRequest() ret=0x%x %@: Invalid argument. requestPerfStatsBuffer=%p: requestStatsBufferSize=%p%@: HW Execution time: %llu ns (%.2f ms)%@: Write perf counters%@ : %@%@: ANEDeviceController not instantiated in VM%@ : self.usecount=%lld self.device=%p self.isPrivileged = %d%@: Calling ANEDeviceOpen( deviceUsageType=%u programHandle = %llu )%@: ANEDeviceOpen() failed: ret=%u %@: self.usecount=%lld self.device=%p%@: ANEDeviceClose() failed: ret=%u %@: ANEDeviceClose() self.usecount=%lld self.device=%p%@%@ : ANEProgramProcessRequestDirect() Failed with status=0x%x statusType=0x%x LModel=% @%@: Async Request could not be queued timed out ret=0x%xself.queueDepth=%ld self.currentAsyncRequests InFlight=%ld lModel=% @-----> % @: ANEProgram ProcessRequestDirect() disableIOFences option not nil value is %d ----->%@ ANEProgramProcessRequestDirect() status=0x%x statusType=0x%x: qos=0x% x%@: Expecting EventPayLoad LModel=%@%@: Could not process request ret=0x%x LModel=%@Unknown _ANESignalEventType=%lu using (%lu) Unknown _ANEWaitEventType=%lu using (%lu) ANEVirtualClient kern. hv_vmm_present returned false ANEVirtualClient IOServiceGetMatchingServices returned 0x%08x
ANEVirtualClient Iterator was NULL not avpANE.
ANEVirtualClient Found a device of class AppleVirtIONeuralEngineDevice ANEVirtualClient FAILED IOSERVICE OPENANEVirtualClient No matching drivers found. ANEVirtualClient Calling functions from userspace to kernel space...
ANEVirtualClient: Successfully called method at kAppleVirtIONeuralEngine DeviceUserClient Open %d in kernel space.
%@: No Virtual Device available%@: ANEVirtualClient start
%@ ANEVirtualClient CompileModel success MODEL: %@
%@: ANEVirtualClient unarchive error %@
%@: ANEVirtualClient start Model=%@ options=%@
ANEVirtualClient virtualANEModel.ioSIDModelNet=%u virtualANEModel.ioSIDModelShape=%u virtualANEModel.ioSIDModelWeight=%u virtualANEModel.ioSIDKey=%U virtualANEModel.string_id=%lld virtualANEModel.programHandle=%lld virtualANEModel.intermediateBuffer Handle=%lld virtualANEModel.queueDepth=%d
virtualANEModel.ioSIDModelAttributes=%u virtualANEModel. ModelAttributeLength=%llu virtualANEModel.perfStatsMask=%u virtualANEModel.qos=%u virtualANEModel.ioSIDOptions=%u virtualANEModel.ioSIDErrorValue=%u %@: ANEVirtualClientLoadModel success MODEL: %@
%@ ANEVirtualClient LoadModel no success %lld.
ANEVirtualClientLoadModell: %@ ANEVirtualClientLoadModel2: %@
ANEVirtualClientLoadModel3: %d
ANEVirtualClientvirtualANEModel.ioSIDModelNet=%u virtualANEModel.ioSIDModelShape=%u virtualANEModel.ioSIDModelWeight=%u virtualANEModel.ioSIDKey=%U virtualANEModel.string_id=%lld virtualANEModel.programHandle = %lld virtualANEModel.intermediateBufferHandle = %lld virtualANEModel.queueDepth=%d virtualANEModel.ioSIDModelAttributes=%u virtualANEModel.perfStats Mask=%u virtualANEModel.qos=%u virtualANEModel.ioSIDOptions=%u virtualANEModel.ioSIDErrorValue=%UANEVirtualClient evaluateWithModell: %@
ANEVirtualClient evaluateWithModel2: %@ ANEVirtualClient evaluateWithModel3: %@ ANEVirtualClientevaluateWithModel4: %d
ANEVirtualClient Evaluate: virtualANEModel.ioSIDModelNet=%u virtualANEModel.ioSIDModelShape=%u virtualANEModel.ioSIDModelWeight=%u virtualANEModel.ioSIDKey=%u virtualANEModel.string_id=%lld virtualANEModel.programHandle = %lld virtualANEModel.intermediateBuffer Handle = %lld virtualANEModel.queueDepth=%d virtualANEModel.ioSIDModelAttributes=%u virtualANEModel.perfStats Mask=%u virtualANEModel.qos=%u virtualANEModel.ioSIDOptions=%u
virtualANEModel.ioSIDErrorValue=%UANEVirtualClient Evaluate request1 ioSID: %UANEVirtualClient Evaluate request2 ioSID: %llUANEVirtualClient Evaluate request3 ioSID: %UANEVirtualClient Evaluate request4 ioSID: %lluANEVirtualClient Evaluate: request.inputArray %lu request.inputIndexArray %lu request.outputArray %lu request.outputIndexArray %LUANEVirtualClient Evaluate request5 ioSID: %UANE VirtualClient Evaluate request6 ioSID: %UANEVirtualClient Evaluate request7 ioSID: %ld %@: ANEVirtualClient ioSPerformanceStats pointer null
%@
ANEVirtualClient ioSurfaceRef ID=%U
ANEVirtualClient Connect to driver for kApple VirtIONeuralEngine DeviceUserClientEvaluateWithModel.%@: ANEVirtualClient length=%lu hashString=%@
%@ ANEVirtualClient Successfully called method %d result=%d.
%@ ANEVirtualClient buildVersion: %@
%@ ANEVirtualClient Successfully called method %d
%@: ANEVirtualClient guestCapability Mask=%llu
%@: ANEVirtualClient Successfully called method %d result=%s.
%@ ANEVirtualClient Legacy host detected. Using legacy protocol.
%@: ANEVirtualClient hostBuildVersion=%@ : hostDataInterfaceVersion=0x%x
hostCapabilityMask=0x%llx.
%@: Failed to call method %d with error 0x%xANEVirtualClient mapIOSurfacesWithModel: %@
ANEVirtualClient doMapIOSurfacesWithModel: %@
ANEVirtualClient doMapIOSurfacesWithModel: %d
ANEVirtualClient mapIOSurfacesWithModel: virtualANEModel.ioSIDModelNet=%u virtualANEModel.ioSIDModelShape=%u virtualANEModel.ioSID ModelWeight=%u virtualANEModel.ioSIDKey=%u virtualANEModel.string_id=%lld virtualANEModel. programHandle = %lld virtualANEModel. intermediateBufferHandle=%lld virtualANEModel.queueDepth=%d virtualANEModel.ioSIDModelAttributes=%u virtualANEModel.perfStatsMask=%u virtualANEModel.qos=%u virtualANEModel.ioSIDOptions=%u virtualANEModel.ioSIDErrorValue=%UANEVirtualClient mapIOSurfacesWithModel request1 ioSID: %UANEVirtualClient mapIOSurfacesWithModel request2 ioSID: %llUANEVirtualClient mapIOSurfacesWithModel request3 ioSID: %UANEVirtualClient mapIOSurfacesWithModel request4 ioSID: %lluANEVirtualClient mapIOSurfacesWithModel: request.inputArray %lu request.inputIndexArray %lu request.outputArray %lu request.outputIndexArray %lUANEVirtualClient mapIOSurfacesWithModel request5 ioSID: %UANEVirtualClient mapIOSurfacesWithModel request6 ioSID: %UANEVirtualClient mapIOSurfacesWithModel request7 ioSID: %ld % @: ANEVirtualClient mapIOSurfacesWithModel _ioSPerformanceStats pointer null %@ ANEVirtualClient mapIOSurfacesWithModel ioSurface Ref ID=%U
ANEVirtualClient Connect to driver for kAppleVirtIONeuralEngine DeviceUserClientMapIOSurfacesWithModel.%@: VirtualANEModel struct empty.%@: ANEVirtualClient: hwx new filePath = % @%@: ANEVirtualClient: weightname=% @%@: ANEVirtualClient: weightname contained symlink%@: ANEVirtualClient: .net filepath=%@ netname=%@ : shapename=%@ weightname=%@ % @: ANEVirtualClient: %@
%@: ANEVirtualClient: %lu execeed max number of reference expresso files %d
ioSModelEspressoRefFile Name [%d] surface ID: %d Length: %llu fileEspresso %@
ioSIDModelEspressoRefFile [%d] surface ID: %d length: %llu
%@ ANEVirtualClient Cannot read netfilename=%@
%@ ANEVirtualClient weightfilename is Not empty
%@: ANEVirtualClient weightfilename=%@
%@: ANEVirtualClient weightfilename does not exists.
%@ ANEVirtualClient no match for weightfilename.
%@: ANEVirtualClient could not parse Json.
%@: Invalid decompression algorithm %c %@: Block size too big %lld %@: Mismatching decompression size %zu %zu %@: ANEVirtualClient options empty %@ FILEData wrote %lu
%@ ANEVirtualClient ioSurfaceRef pointer null
%@ ANEVirtualClient ioSID pointer null
%@ ANEVirtualClient length=0
%@ ANEVirtualClient data in bytes %lu length %lu IOID: %u
getModelAttribute: DataBaseAddress nullgetModelAttribute: IOSATTribute null%@: ANEVirtualClient LoadModel Model Attribute Length %llu Model Attribute value %@ %@ ANEVirtualClient Successfully called method %d.
%@ Failed to call method %d with error %d%@: Failed with NULL databaseAddress%@: No Data in performanceStats with length = %lluanesubtype %d%@: Unknown KMGQAppleNeuralEngineSubtype=0x%llx using (%@)%@: client (%d): missing entitlement (%@)%@: directoryPath=%@ : err=% @%@: modelFilePath=%@%@: open(%s, (0_ RDONLY |0_NOFOLLOW)) failed. errno= %d %s%@: stat (%s) failed. errno = %d %s%@: fcntl (F_RDADVISE). errno=%d %s % @: mmap(%s) failed. sbuf.st_size=%lld: fd=%d errno=%d %s % @: munmap (%s) failed. bytes=%p len=%lu errno=%d %s%@: nil modelData for %s%@: +update AccessTimeForFilePath:%@ failed%@: setxattr(%@, %@, %p, %lu) failed : errno=%d%@: getxattr (%@, %@, %p, %lu) missing attribute : errno=%d%@: getxattr(%@, %@, %p, %lu) failed : errno=%d%@: filePath=%@%@: +setAccessTime: forFilePath failed%@: Skipping update for filePath=%@Failed to remove %@ error=%@%@: START pathURL=%@%@: URL=%@ error=%@%@: ---> url=%@%@: Nil sourcePathname! srcStoreURL=%@ LErr=%@%@: --->> source Pathname=%@%@: Missing sourcePathname=%@ isDirectory=%d%@: Remove modelDirURL=%@ : %@%@: END - pathURL=%@ attemptedCount=%lu removedCount=%lu%@: attributesOfItemAtPath: error: failed. directoryPath=%@ err=%@%@: subpathsOfDirectoryAtPath: error: failed. directoryPath=%@ err=%@%@: attributesOfItemAtPath: error: failed. modelDirectoryPath=%@ err=%@%@: subpathsOfDirectoryAtPath: error: failed. modelDirectoryPath=%@ : err=%@%@: removing %@%@: FAILED to remove %@Fail to open %s %{darwin.errno}dFail to mark %s as purgeable (err %d) (%{darwin.errno}d) (flags 0x%llx) Mark %s as purgeable (flags 0x%llx)%@: START: pathURL=%@%@: garbageCollect DanglingModelsAtPath: fsiled%@: END: pathURL=%@_ANEProgramIOSurfacesMapper_ANEPerformanceStats_ANEErrors_ANEDeviceController_ANEDataReporter_ANEProgramForEvaluation!_
ANEVirtualClient_ANEDeviceInfo_ANEStorageMaintainer ProtocolServiceDelegateNSXPCListenerDelegate NSObject_ANEStorageHelper_ANEStrings_ANELog_ANEStorageMaintainerv16
@0:8@16@0:8@24@0:8Q16@24@0:8@16B32@0:8@16@24v32@0:8^{ANEMemoryMappingParams Struct=[128{ANEBufferStruct=^{_IOSurface}IiiI}]QIIQ} 16@24B44@0:8@16@24B32^@36B40@0:8@16@24^@32Q16@0:8@"_ANEDeviceController"QI20@0:8116@32@0:8^^v16^I24@32@0:8@16Q24@20@0:8116@32@0:8Q16@24v24@0:8Q16@"NSData"@32@0: 8q16@24@32@0:8@16q24@28@0:8Q16B24q16@0:8v24@0:8q16B16@0:8^{ANEDevice Struct=^v^v^vCi}16@0:8v24@0:8^{ANEDevice Struct=^v^v^vCi}16Bq^{ANEDeviceStruct=^v^v^vCi}

v32@0:8q16@24@32@0:8@16@24@36@0:8Q16Q24c32@36@0:8@16Q24c32@40@0:8^{ANENotificationMessageStruct=ii^v [4^v] [41]}
16@24@32B68@0:8@16@24132Q36Q44@52^@60c16@0:8c@"NSObject<OS_dispatch_semaphore>"B44@0:8@16@24132^@36B52@0:8@16@24@32140^@44B24@0:8@16v24@0:8@16v40@0:8@16@24^{ VMData=^_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}
^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} [32^{_IOSurface}] [32^{_IOSurface}]{VirtANEModel=IqIIIIQQQQ[321] [320] [321] [32Q]QQQCCIQIIIQIIQIQ[641][641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ} {VirtANEModel=IqIIIIQQQQ[321] [320] [321] [32Q]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}} 32v32@0:8@16^{VMData=^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} ^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} [32^{_IOSurface}] [32^{_IOSurface}]{VirtANEModel=IqIIIIQQQQ [321] [320] [321] [320]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}{VirtANEModel=IqIIIIQQQQ [321] [32Q] [321] [320] QQQCCIQIIIQIIQIQ[641][641][641]
[641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}}24v24@0:8^{VMData=^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} ^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} [32^{_IOSurface}] [32^{_IOSurface}] {VirtANEModel=IqIIIIQQQQ [321] [320] [321] [32Q]QQQcCIQIIIQIIQIQ[641] [641] [641] [641] IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}{VirtANEModel=IqIIIIQQQQ[321] [320] [321] [320]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}}16^{__IOSurface=}40@0:8@16Q24^132@24@0:8^{VMData=^{_IOSurface}^{_IOSurface} ^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface} ^{_IOSurface}^{_IOSurface} [32^{_IOSurface}] [32^{_IOSurface}]{VirtANEModel=IqIIIIQQQQ[321] [320] [321] [32Q]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}{VirtANEModel=IqIIIIQQQQ [321] [320] [321] [32Q]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}} 16B36@0:8116^{VirtANEModel=IqIIIIQQQQ [321] [320] [321] [32Q1QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}20^{VirtANEModel=IqIIIIQQQQ[321] [320] [321] [320] QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}28v32@0:8116120^{VirtANEModel=IqIIIIQQQQ [321] [320] [321] [320]QQQCCIQIIIQIIQIQ[641][641][641][641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}24B32@0:8^{VMData=^{_IOSurface}^{_IOSurface}^{_IOSurface}^{_IOSurface}
^{_IOSurface}^{_IOSurface}^{__IOSurface}^{__IOSurface}^{__IOSurface}^{_IOSurface}^{__IOSurface}^{__IOSurface}^{__IOSurface}^{_IOSurface}^{_IOSurface} [32^{IOSurface}] [32^{_IOSurface}]{VirtANEModel=IqIIIIQQQQ [321] [320] [321] [32Q]QQQCCIQIIIQIIQIQ[641] [641] [641] [641]IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ} {VirtANEModel=IqIIIIQQQQ [321] [320] [321] [32Q1QQQCCIQIIIQIIQIQ[641] [641] [641] [641] IQQ[641] [641]IIIIIIQqIIQIQIQIQIQIQ}} 16^@24116@0:8v20@0:81161@"NSObject<OS_dispatch_queue>"@"NSString "v32@0:8@16@?24v32@0:8@"NSURL"16@?<v@?
B>24#16@0:8@24@0:8:16@32@0:8:16@24@40@0:8:16@24@32B24@0:8#16B24@0:8:16Vv16@0:8^{_NSZone=}
16@0:8B24@0:8@"Protocol "16@"NSString "16@0:8B32@0:8@"NSXPCListener "16@" NSXPCConnection "24@32@0:8@16^@24@36@0:8@16B24^@28v40@0:8@16@24@32v40@0:8@16@24Q32@28@0:8@ 16B24B32@0:8@16^@
24
H_ANECCreateModelDictionary_AnalyticsSendEventLazy_CFRelease_IOConnectCallMethod_IOConnectCallScalarMethod_IOIteratorNext_10ObjectRelease_IOServiceGetMatchingServices_IOServiceMatching_IOServiceOpen_IOSurfaceCreate_IOSurfaceGetBaseAddress_IOSurfaceGetID_IOSurfaceLock_IOSurfaceUnlock_MGGetBoolAnswer_MGGetSInt64Answer_MGGetStringAnswer_NSLog_NSStringFromClass_NSStringFromSelector_Block_object_assign_Block_object_dispose_Unwind_Resume_ZSt9terminatev___cxa__begin_catch___error___gxx_personality_v0___memcpy_chk___objc_personality_v0___stack_chk_fail_os_log_debug_impl_os_log_error_impl_os_log_impl_bzero_calloc_close_compression_decode_buffer_dispatch_async_dispatch_once_dispatch_queue_attr_make_with_autorelease_frequency_dispatch_queue_create_dispatch_semaphore_create_dispatch_semaphore_signal_dispatch_semaphore_wait_dispatch_sync_dispatch_time_dlopen_dlsym_fcntl_ffsctl_free_fstat_getxattr_kdebug_is_enabled_kdebug_trace_memcpy_mmap_munmap_objc_alloc_objc_autorelease_objc_autoreleasePoolPop_objc_autoreleasePoolPush_objc_autoreleaseReturnValue_objc_enumerationMutation_objc_msgSend_objc_msgSendSuper2_objc_opt_class_objc_opt_isKindOfClass_objc_opt_new_objc_release_objc_retain_objc_retainAutorelease_objc_retainAutoreleaseReturnValue_objc_retainAutoreleasedReturnValue_objc_storeStrong_open_os_log_create_os_log_type_enabled_os_unfair_lock_lock_with_options_os_unfair_lock_unlock_setxattr_strerror_sysctlbyname_NSFilePathErrorKey_NSFileTypeSymbolicLink_NSKeyedArchiveRootObjectKey_NSLocalizedDescriptionKey_NSPOSIXErrorDomainNSURLISRegularFileKey_NSConcreteStackBlock___NSDictionary0_struct___stack_chk_guard_KIOMainPortDefault_kIOSurfaceAllocSize_mach_task_self____chkstk_darwin_NSConcreteGlobalBlock______CFConstantStringClassReference_OBJC_CLASS_$_NSConstantDictionary_OBJC_CLASS_$_NSConstantIntegerNumber_OBJC_CLASS_$_NSConstantArray_OBJC_CLASS_$_NSNumber_OBJC_CLASS$_NSString_OBJC_CLASS_$_NSData_OBJC_CLASS_$_NSError_OBJC_CLASS_$_NSDictionary_OBJC_CLASS_$_NSSet_OBJC_CLASS_$_NSArray_OBJC_CLASS_$_NSKeyedUnarchiver_OBJC_CLASS$_NSKeyedArchiver_OBJC_CLASS_$_NSMutableString_OBJC_CLASS_$_NSFileManager_OBJC_CLASS_$_NSJSONSerialization_OBJC_CLASS_$_NSMutableData_OBJC_CLASS_$_NSXPCInterface_OBJC_CLASS_$_NSXPCListener_OBJC_CLASS_$_NSDate_OBJC_CLASS_$_NSMutableSet_objc_empty_cache_OBJC_CLASS_$_NSObject_OBJC_METACLASS_$_NSObject_os_log_default_#ÀNumberStringANEStorageMaintainerVersionOBJC_mh_execute_headerkANEmain0
ServiceDelegatem_ANEDataReportereviceController «InfoDErrorsLogPStVirtualClient»
ForEvaluation IOSurfacesMapper performanceStatsprogram
HelperMaintainerstorageringsCLASS_$_SMETACLASS_$_3⁄4à1 ServiceDelegate,_ANEDataReporterDeviceController÷InfoDBErrorsLogPSTVirtualClientPerformanceStatsProgramForEvaluationIOSurfacesMapperHelperMaintainerStorageringsCacheDetailsKeyiDirectorySizeKeyDModelFAModelKeyCompilerOptionsFilenameKeyDisableIOFencesUse SharedEventsKey
NetPlistFilenameKey
PerformanceStatsMaskKey
LateLatchKeyPowerSavingKeyenableEspressoFileResourcesKeyIdentifierKeysCachedKey
memoryPoolIDKeyModelDescriptionKey
LoadPerformanceStatsKeyMILValueOutputSymbolPrTypeKeyIdentityStrKey
inputSymbolp
isEncryptedKey
IndexArrayKey
isArrayKey
IndexArrayKey
isArrayKey,
deCompiledValue
Procedure
IDKey
Name To
ANECIRValueCoreMLValue
MemoryModelItermediateBufferHandleKey
SArrayKey+
IDMapKey
StatsSizeMapKey

ALLSegmentsValueEEspressoTranslationOptionsNoSegmentsValue

RSTUWZtx_ANEStorageMaintainerVersionNumber_ANEStorage MaintainerVersionString_OBJC_CLASS_$_ServiceDelegate_OBJC_CLASS_$__ANEDataReporter_OBJC_CLASS_$___ANEDeviceController_OBJC_CLASS_$_ANEDeviceInfo_OBJC_CLASS_$__ANEErrors_OBJC_CLASS_$_ANELog_OBJC_CLASS_$__ANEPerformanceStats_OBJC_CLASS_$_ANEProgramForEvaluation_OBJC_CLASS_$__ANEProgramIOSurfacesMapper_OBJC_CLASS_$__ANEStorageHelper_OBJC_CLASS_$__ANEStorageMaintainer_OBJC_CLASS_$__ANEStrings_OBJC_CLASS_$__ANEVirtualClient_OBJC_METACLASS_$_ServiceDelegate_OBJC_METACLASS_$__ANEDataReporter_OBJC_METACLASS_$__ANEDeviceController_OBJC_METACLASS_$__ANEDeviceInfo_OBJC_METACLASS_$__ANEErrors_OBJC_METACLASS_$__ANELog_OBJC_METACLASS_$__ANEPerformanceStats_OBJC_METACLASS_$__ANEProgramForEvaluation_OBJC_METACLASS_$_ANEProgramIOSurfacesMapper_OBJC_METACLASS_$__ANEStorageHelper_OBJC_METACLASS_$__ANEStorage Maintainer_OBJC_METACLASS_$__ANEStrings_OBJC_METACLASS_$. ANEVirtualClient_mh_execute_header_kANEDModelCacheDetails Key_kANEDModelDirectorySizeKey_kANEFCompilerOptionsFilenameKey_kANEFDisableIOFencesUseSharedEventsKey_kANEFEnableLateLatchKey_kANEFEnablePowerSavingKey_kANEFEspressoFileResourcesKey_kANEFInMemory ModelIdentifierKey_kANEFInMemoryModelIsCachedKey_kANEFIntermediateBufferHandleKey_kANEFMemoryPoolIDKey_kANEFModelANECIRValue_kANEFModelCoreMLValue_kANEFModelDescriptionKey_kANEFModelIdentityStrKey_ kANEFModelInputSymbolIndexArrayKey_kANEFModelInputSymbolsArrayKey_kANEFModelIsEncryptedKey_kANEFModelLoadPerformanceStatsKey_kANEFModelMILValue_kANEFModelOutputSymbolIndexArrayKey_kANEFModelOutputSymbolsArrayKey_kANEFModelPreCompiledValue_kANEFModel Procedure IDKey_kANEFModelProcedureNameToIDMapKey_kANEFModelProcedureNameToStatsSizeMapKey_kANEFModelProceduresArrayKey_kANEFModelTypeKey_kANEFNetPlistFilenameKey_kANEFPerformanceStatsMaskKey_kANEModelKeyAllSegmentsValue_kANEModelKeyEspressoTranslationOptions_kANEModelKeyNoSegmentsValue_main_ANECCreateModelDictionary_AnalyticsSendEventLazy_CFRelease_IOConnectCallMethod_IOConnectCallScalarMethod_IOIteratorNext_10ObjectRelease_IOServiceGetMatchingServices_IOServiceMatching_IOService Open_IOSurfaceCreate_
IOSurfaceGetBaseAddress_IOSurface GetID_IOSurface Lock_IOSurfaceUnlock_MGGetBoolAnswer_MGGetSInt64Answer_MGGetStringAnswer_NSFilePathErrorKey_NSFileTypeSymbolicLink _NSKeyedArchive RootObject Key_NSLocalizedDescriptionKey_NSLog_NSPOSIXErrorDomain NSStringFromClass_NSStringFromSelector_NSURLISRegular FileKey_OBJC_CLASS_$_NSArray_ OBJC_CLASS_$_NSConstantArray_OBJC_CLASS_$_NSConstantDictionary_OBJC_CLASS_$_NSConstant Integer Number_OBJC_CLASS_$_NSData_OBJC_CLASS_$_NSDate_OBJC_CLASS_$_ NSDictionary_OBJC_CLASS_$_NSError_OBJC_CLASS_$_NSFile Manager_OBJC_CLASS_$_NSJSONSerialization_OBJC_CLASS_$_NSKeyedArchiver_OBJC_CLASS_$_NSKeyedUnarchiver_OBJC_
CLASS_$_NSMutableData_OBJC_CLASS_$_NSMutableSet_OBJC_CLASS_$_NSMutableString_OBJC_CLASS_$_NSNumber_OBJC_CLASS_$NSObject_OBJC_CLASS_$_NSSet_OBJC_CLASS_$_NSString_ OBJC_CLASS_$_NSXPC Interface_OBJC_CLASS_$_NSXPCListener_OBJC_METACLASS_$_NSObject_Block_object_assign_Block_object_dispose_NSConcreteGlobalBlock____ personality_v0___memcpy_chk___objc_personality_v0___stack_chk_fail___stack_chk_guard_objc_empty_cache_os_log_debug_impl_os_log_default_os_log_error_impl_os_ log_impl_bzero_calloc_close_compression_decode_buffer_dispatch_async_dispatch_once_dispatch_queue_attr_make_with_autorelease_frequency_dispatch_queue_create_ dispatch_semaphore_create_dispatch_semaphore_signal_dispatch_semaphore_wait_dispatch_sync_dispatch_time_dlopen_dlsym_fcntl_ffsctl_free_fstat_getxattr_
NSConcreteStackBlock_Unwind_Resume_ZSt9terminatev___CFConstantStringClass Reference___NSDictionary@__struct___chkstk_darwin___cxa_begin_catch___error___gxx_
KIOMainPortDefault_kIOSurface AllocSize_kdebug_is_enabled_kdebug_trace_mach_task_self_memcpy_mmap_munmap_objc_alloc_objc_autorelease_objc_autoreleasePoolPop_objc_
autoreleasePoolPush_objc_autoreleaseReturnValue_objc_enumerationMutation_objc_msgSend_objc_msgSend Super2_objc_opt_class_objc_opt_isKindOfClass_objc_opt_new_objc_ enabled_os_unfair_lock_lock_with_options_os_unfair_lock_unlock_setxattr_strerror_sysctlbyname
release_objc_retain_objc_retainAutorelease_objc_retainAutoreleaseReturnValue_objc_retainAutoreleasedReturnValue_objc_storeStrong_open_os_log_create_os_log_type_



